Repository: Theinet/PdfCompressor
Catalog: PdfCompressor/Properties/Resources.*.resx
Languages: uk

# AboutText
source: This app lets you manipulate PDF files: compress, merge, split, extract, and more.
uk: Ця програма дозволяє працювати з PDF: стиснення, злиття, поділ, витяг тексту та зображень.

source: Add PDF first
uk: Спочатку додайте PDF

# Added
source: File added
uk: Файл додано

source: All files removed
uk: Усі файли видалено

source: Already empty
uk: Список вже порожній

# ButtonCompress
source: Compress
uk: Стиснути

source: Cancel
uk: Скасувати

# Compressed
source: Compressed "{0}" from {1} to {2}
uk: Стиснено "{0}": {1} → {2}

source: Compression completed
uk: Стиснення завершено

# CompressionDone
source: Compression completed
uk: Стиснення завершено

# CompressionFailed
source: Error compressing file
uk: Помилка під час стиснення файлу

# CompressionQuality
source: Automatic compression
uk: Автоматичне стиснення

# CompressionReady
source: Ready
uk: Готово

# CompressionSkipped
source: Skipped "{0}": already compressed or not compressible.
uk: Пропущено "{0}": файл вже стиснутий або не підлягає.

# CompressionSkippedSmall
source: Skipped "{0}": file too small for compression.
uk: Пропущено "{0}": файл занадто малий для стиснення.

source: Compression started
uk: Стиснення розпочато

# ConversionDone
source: Conversion completed
uk: Конвертацію завершено

source: Delete
uk: Видалити

source: Delete even pages
uk: Видалити парні сторінки

source: Delete odd pages
uk: Видалити непарні сторінки

# DropHere
source: Drag a file here
uk: Перетягніть файл сюди

# DragHintAdmin
source: Drag and drop doesn't work in admin mode
uk: Перетягування не працює в режимі адміністратора

# EnterImageFormat
source: Enter image format (e.g. png, jpg, bmp, tiff):
uk: [MISSING_UK] Enter image format (e.g. png, jpg, bmp, tiff):

# EnterPagesToRemove
source: Enter page numbers to remove (e.g. 1-3,5,8):
uk: Введіть сторінки для видалення (приклад: 1-3,5,8):

source: Error
uk: Помилка

# ErrorSavingImage
source: Error saving {0}: {1}
uk: Помилка збереження {0}: {1}

# EvenOddPrompt
source: Delete even / odd pages
uk: Видалити парні / непарні сторінки

# EvenPages
source: Even
uk: Парні

# FormatNotSupported
source: Format "{0}" is not supported
uk: Формат «{0}» не підтримується

# InvalidDpiRange
source: DPI must be between 30 and 1200. Current: {0}
uk: DPI має бути в межах від 30 до 1200. Поточне значення: {0}

# ImageExport_DpiLabel
source: Image quality (DPI), range: 30–1200
uk: Якість зображення (DPI), діапазон: 30–1200

# ImageExport_FormatLabel
source: Select image format:
uk: Оберіть формат зображення:

# ImageExport_Title
source: Export Settings
uk: Параметри експорту

source: Image format
uk: [MISSING_UK] Image format

source: Image format not supported
uk: Формат зображення не підтримується

# ImageParamError
source: Invalid image parameter.
uk: Неправильний параметр зображення.

# ImageSaved
source: Saved: {0}
uk: Збережено: {0}

source: Images converted
uk: Зображення конвертовано

source: Images exported to
uk: Зображення збережено у

source: Images extracted
uk: Зображення витягнуто

source: Info
uk: Інформація

source: Items swapped
uk: Елементи переміщено

source: Loading...
uk: Завантаження...

# LogAddedFile
source: Added: {0}
uk: Додано: {0}

# LogAllFilesRemoved
source: All files removed
uk: Усі файли видалено

# LogCompressionDone
source: Compression done: {0}
uk: Стиснення завершено: {0}

# LogCompressionStarted
source: Compression started
uk: Стиснення розпочато

# LogError
source: Error: {0}
uk: Помилка: {0}

# LogItemsSwapped
source: Items swapped.
uk: Елементи переміщено

# LogPagesRemoved
source: Pages removed: {0}
uk: Сторінки видалено: {0}

# LogReady
source: Ready
uk: Готово

# LogRemovedFile
source: Removed: {0}
uk: Видалено: {0}

# MenuAbout
source: About
uk: Про програму

# MenuActions
source: Actions
uk: Дії

# MenuAddPdf
source: Add PDF
uk: Додати PDF

# MenuClearLog
source: Clear Log
uk: Очистити лог

# MenuCompressPdf
source: Compress PDF
uk: Стиснути PDF

# MenuConvertToImages
source: Convert to Images
uk: Конвертувати в зображення

# MenuExit
source: Exit
uk: Вихід

# MenuExtractImages
source: Extract Images
uk: Витягти зображення

# MenuExtractText
source: Extract Text
uk: Витягти текст

# MenuFile
source: File
uk: Файл

# MenuHelp
source: Help
uk: Допомога

# MenuLanguage
source: Language
uk: Мова

# MenuRemoveAll
source: Remove All
uk: Очистити список

# MenuRemovePages
source: Remove Pages
uk: Видалити сторінки

# MenuSafeMerge
source: Safe Merge
uk: Безпечне злиття

# MenuSplitPdf
source: Split PDF
uk: Розділити PDF

# MergedCreated
source: Merged PDF created
uk: PDF об’єднано

# MsgAddPdfFirst
source: Add PDF first
uk: Спочатку додайте PDF

# MsgAlreadyEmpty
source: Already empty
uk: Список вже порожній

# MsgCompressionDone
source: Compression completed
uk: Стиснення завершено

# MsgImagesExtracted
source: Images extracted: {0}
uk: Зображень витягнуто: {0}

# MsgMergeDone
source: Merged PDF created
uk: PDF успішно об’єднано

# MsgPagesDeleted
source: Pages deleted
uk: Сторінки видалено

# MsgSelectPdfFirst
source: Select a PDF first
uk: Спочатку виберіть PDF

# MsgSplitDone
source: Split done
uk: Розділення завершено

# MsgTextExtracted
source: Text extracted
uk: Текст витягнуто

# NoAppAssociated
source: No application is associated with the specified file
uk: Не встановлено застосунок для відкриття файлу

source: Ok
uk: Добре

# OddPages
source: Odd
uk: Непарні

source: Pages deleted
uk: Сторінки видалено

# PdfConvertedSuccess
source: PDF converted to {0} images successfully.
uk: PDF успішно конвертовано у {0} зображення.

source: Print
uk: Друк

source: Print error
uk: Помилка друку

# PrintOnlyOne
source: Select only one file for printing.
uk: Для друку виберіть лише один файл.

# PrintSent
source: Sent to printer:
uk: Відправлено на друк:

# PromptEvenOdd
source: Remove even or odd pages?
uk: Видалити парні чи непарні сторінки?

# PromptRemovePages
source: Enter page numbers to remove (e.g. 1-3,5,8):
uk: Введіть номери сторінок для видалення (наприклад: 1-3,5,8):

# PdfEmptyError
source: PDF has no pages. Skipped.
uk: PDF не містить сторінок. Пропущено.

# QualityHigh
source: High
uk: Висока

# QualityLow
source: Low
uk: Низька

# QualityMedium
source: Medium
uk: Середня

source: Ready
uk: Готово

source: Remove pages
uk: Видалити сторінки

# RemovePagesTitle
source: Remove Pages
uk: Видалення сторінок

source: Removed
uk: Видалено

# RenderingPage
source: [RenderingPage]: {0}, {1}x{2} @ {3} DPI
uk: [Рендер сторінки]: {0}, {1}x{2} @ {3} DPI

# RunAsAdminWarningLog
source: Application is running as administrator — Drop is disabled.
uk: Програму запущено від імені адміністратора — Перетягування не працює.

# RunAsAdminWarningMessage
source: You are running the application as administrator, so drag and drop is disabled. Please select PDF manually.
uk: Ви запустили програму від імені адміністратора, тому перетягування вимкнено. Оберіть PDF вручну.

# SelectAtLeastTwo
source: Please select at least two PDF files.
uk: Будь ласка, виберіть щонайменше два PDF.

source: Select image format
uk: Оберіть формат зображення

# SelectOneFile
source: Please select a file.
uk: Будь ласка, виберіть файл.

# SelectOutputFolder
source: Select output location
uk: Виберіть місце для збереження

# SelectPdfFirst
source: Select a PDF first
uk: Спочатку виберіть PDF

source: Split done
uk: Розділення завершено

source: Text extracted
uk: Текст витягнуто

# TitleAbout
source: About
uk: Про програму

# TitleDone
source: Done
uk: Готово

# TitleError
source: Error
uk: Помилка

# TitleFile
source: File
uk: Файл

# TitleRemovePages
source: Remove Pages
uk: Видалити сторінки

# UnsupportedFormat
source: Unsupported image format
uk: Непідтримуваний формат зображення
